%目标函数向量
f=-[-1.4375,0.0775,0.0310,2.30,2.50,2.80,-1.4840,0.0750,0.0310,0.0264,2.12];
%不等式约束
m=zeros(2,4);
n=zeros(2,5);
k=eye(2);

A=[m,k,n];
b=[4;3];
%等式约束
e1=ones(4,1);
e2=ones(5,1);
e3=[0 1;1 0];
e4=zeros(1,2);
e5=zeros(2,2);
m=spdiags([-1.15*e1 e1],[-2 0],5,4);
n=spdiags([e2 -1.06*e2],[0 -1],5,5);
k=[e4;e3;e5];

Aeq=[m,k,n];
beq=[10;0;0;0;0];
%自然约束
lb=zeros(1,11);

%最优化计算
[x,fval] = linprog(f,A,b,Aeq,beq,lb);

%结果输出
x11=x(1)
x21=x(2)
x31=x(3)
x41=x(4)
x32=x(5)
x23=x(6)
x14=x(7)
x24=x(8)
x34=x(9)
x44=x(10)
x54=x(11)
fval=-fval