%药物急性中毒施救方案
%画图比较程序
%数据来自maple
%不采取任何措施
t=0:0.001:40;
t0=t;
x0=0.1100e4 * exp(-log(0.2e1) * t/ 0.5e1);
y0=0.6600e4 * exp(-log(0.2e1) * t/ 0.6e1) - 0.6600e4 * exp(-log(0.2e1) * t/ 0.5e1);
%采取口服活性炭
t=2:0.001:40;
t1=t;
y1=-0.4125e4 / log(0.2e1) * (-0.4e1 / 0.5e1 * log(0.2e1) * (2 ^ (0.2e1 / 0.3e1)) + log(0.2e1) * (2 ^ (0.3e1 / 0.5e1))) * (2 ^ (0.2e1 / 0.3e1)) * exp(-log(0.2e1) * t / 0.3e1) + 0.1650e4 * exp(-log(0.2e1) * t / 0.5e1);
%采取血液透析
t=2:0.001:40;
t2=t;
y2=0.2750e4 * (0.24e2 / 0.5e1 * log(0.2e1) * (2 ^ (0.2e1 / 0.3e1)) - 0.5e1 * log(0.2e1) * (2 ^ (0.3e1 / 0.5e1))) / log(0.2e1) * exp(-log(0.2e1) * t) + 0.275e3 * exp(-log(0.2e1) * t / 0.5e1);
%采取一次洗净
t=2:0.001:40;
t3=t;
x3=zeros(size(t3));
y3=-0.3300e4 * (-2 ^ (0.2e1 / 0.3e1) + 2 ^ (0.3e1 / 0.5e1)) * (2 ^ (0.1e1 / 0.3e1)) * exp(-log(0.2e1) * t / 0.6e1);
%采用多次清洗
t01=2:0.01:8/3;
t02=8/3:0.1:40;
t=t01;
x41=440 * 2 .^ (0.1e1 / 0.5e1 - 0.4e1 / 0.5e1 * t);
y41=-0.2640e4/0.19e2*(2.^(0.1e1 / 0.5e1 - 0.4e1/0.5e1 * t)) - 0.62040e5/0.19e2 * (2.^(-t / 0.6e1 + 0.14e2 / 0.15e2)) + (6600 * 2 .^ (-t / 0.6e1));
t=t02;
x42=110 * 2.^(0.3e1 / 0.5e1 - t / 0.5e1);
y42=-660*2.^(3/5-(1/5)*t)+(11880/19)*2.^(-(1/6)*t+23/45)-(62040/19)*2.^(-(1/6)*t+14/15)+6600*2.^(-(1/6)*t);
t4=[t01 t02];
x4=[x41 x42];
y4=[y41 y42];

%画图比较模块
figure(1);
plot(t0,x0,'b',t0,y0,'r',t1,y1,'c',t2,y2,'m',t3,y3,'--',t4,y4,'--');
legend('胃肠道','不施救血液','活性炭施救血液','透析施救血液','理想洗胃施救血液','实际洗胃施救血液')
grid on;
hold on;
plot(t0,ones(size(t0))*200,'k',t0,ones(size(t0))*400,'r');
plot(7.89103217502095,442.065329218107308,'bo');
plot(5.25819063252530,318.397254992129660,'bo');
a=0:1:1200;
plot(2*ones(size(a)),a,'k--');
title('施救方法对比曲线');
xlabel('t');
ylabel('药量');
pause;


%求根（中毒时间）模块
%中毒时间
tp01=fsolve(@my00,5);
tp02=fsolve(@my00,20);
tp1=fsolve(@my01,10);
tp2=fsolve(@my02,2);
tp3=fsolve(@my03,2);
tp4=fsolve(@my031,5);
plot(tp01,200,'ro',tp02,200,'ro',tp1,200,'ro',tp2,200,'ro',tp3,200,'ro',tp4,200,'ro');
%威胁生命时间
tl01=fsolve(@my10,5);
tl02=fsolve(@my10,10);
plot(tl01,400,'ro',tl02,400,'ro');
hold off
%结果输出模块
fprintf('不施救中毒时间:\n');
tp02-tp01
fprintf('活性炭施救中毒时间:\n');
tp1-tp01
fprintf('透析施救中毒时间:\n');
tp2-tp01
fprintf('理想洗胃施救中毒时间:\n');
tp3-tp01
fprintf('实际洗胃施救中毒时间:\n');
tp4-tp01
fprintf('不施救生命危险时间:\n');
tl02-tl01
pause;

%洗胃对比模块
figure(2);
t=0:0.001:2;
t0=t;
x0=0.1100e4 * exp(-log(0.2e1) * t/ 0.5e1);
y0=0.6600e4 * exp(-log(0.2e1) * t/ 0.6e1) - 0.6600e4 * exp(-log(0.2e1) * t/ 0.5e1);
subplot(1,2,1);
plot(t0,x0,'b',t3,x3,'b',t4,x4,'r');
title('理想与实际洗胃x（t）');
legend('前两小时','理想洗胃','实际洗胃');
grid on;
subplot(1,2,2);
plot(t0,y0,'b',t3,y3,'b',t4,y4,'r');
title('理想与实际洗胃y（t）');
grid on;
legend('前两小时','理想洗胃','实际洗胃');

